In [5]:
import pandas as pd

df = pd.read_excel("car_sales_data.xlsx")

In [2]:
# Pratinjau seluruh data
df[:1048576]

,Date,Salesperson,Customer_Name,Car_Make,Car_Model,Car_Year,Sale_Price,Commission_Rate,Commission_Earned
0,2023-05-01,Jennifer Odonnell,Holly Jones,Nissan,F-150,2022,42275,0.125681,5313.16
1,2023-05-01,Chelsea Lucero,Stanley Perez,Nissan,Civic,2021,36948,0.118207,4367.52
2,2023-05-01,Brittany Herrera,Jo Bennett,Chevrolet,Corolla,2014,18736,0.078463,1470.08
3,2023-05-01,Megan Estes,Jennifer Ramsey,Honda,Altima,2015,35703,0.086066,3072.81
4,2023-05-01,Patrick Lee,Ricardo Wade,Honda,F-150,2018,45915,0.120984,5554.97
...,...,...,...,...,...,...,...,...,...
1048570,2022-05-01,Sara Rowland,Victoria Matthews,Chevrolet,Corolla,2016,23164,0.100149,2319.84
1048571,2022-05-01,Matthew Myers,Danielle Leonard,Ford,F-150,2019,26381,0.063013,1662.34
1048572,2022-05-01,Shelly Gill,Laura Brown,Chevrolet,Silverado,2014,49395,0.112369,5550.48
1048573,2022-05-01,Ricardo Brewer,Danny Martin,Chevrolet,Corolla,2015,23530,0.127042,2989.29
1048574,2022-05-01,Jerry Young,Joseph Taylor,Chevrolet,Corolla,2017,24288,0.088049,2138.55

In [3]:
# Pratinjau 10 data pertama
df[0:10]

,Date,Salesperson,Customer_Name,Car_Make,Car_Model,Car_Year,Sale_Price,Commission_Rate,Commission_Earned
0,2023-05-01,Jennifer Odonnell,Holly Jones,Nissan,F-150,2022,42275,0.125681,5313.16
1,2023-05-01,Chelsea Lucero,Stanley Perez,Nissan,Civic,2021,36948,0.118207,4367.52
2,2023-05-01,Brittany Herrera,Jo Bennett,Chevrolet,Corolla,2014,18736,0.078463,1470.08
3,2023-05-01,Megan Estes,Jennifer Ramsey,Honda,Altima,2015,35703,0.086066,3072.81
4,2023-05-01,Patrick Lee,Ricardo Wade,Honda,F-150,2018,45915,0.120984,5554.97
5,2023-05-01,Mario Matthews,Jay Jensen,Ford,Altima,2015,42569,0.073457,3126.98
6,2023-05-01,Sara Brown,Jennifer Thomas,Chevrolet,Altima,2017,40799,0.119807,4888.01
7,2023-05-01,Laura Riley,Lisa Jackson,Nissan,Altima,2017,38884,0.141096,5486.38
8,2023-05-01,Thomas Boyd,Joshua Riddle,Honda,Corolla,2013,28605,0.148908,4259.52
9,2023-05-01,Robert Fitzgerald,Darrell Rogers,Toyota,Corolla,2016,16874,0.128422,2166.99

In [4]:
# Karakteristik data Salesperson
df["Salesperson"].sort_values()

247903     Aaron Acevedo
319206     Aaron Acevedo
841684     Aaron Acevedo
507510      Aaron Acosta
391996       Aaron Adams
               ...
262496      Zoe Williams
1024672     Zoe Williams
949753        Zoe Wright
387002         Zoe Young
574140      Zoe Young MD
Name: Salesperson, Length: 1048575, dtype: object

In [8]:
# Karakteristik data Customer_Name
df["Customer_Name"].sort_values()

872737    Aaron Acevedo
311054    Aaron Acevedo
915502    Aaron Acevedo
311298    Aaron Acevedo
794165     Aaron Acosta
              ...
689549     Zoe Williams
281023       Zoe Wilson
398614      Zoe Winters
472112         Zoe Wood
939255         Zoe Wood
Name: Customer_Name, Length: 1048575, dtype: object

In [6]:
# Karakteristik data Car_Make
df["Car_Make"].value_counts()

Car_Make
Honda        210101
Ford         210074
Chevrolet    209971
Toyota       209315
Nissan       209114
Name: count, dtype: int64

In [6]:
# Karakteristik data Car_Model
df["Car_Model"].sort_values()

218414       Altima
342316       Altima
174468       Altima
174470       Altima
342314       Altima
            ...
636035    Silverado
412306    Silverado
714723    Silverado
636030    Silverado
933121    Silverado
Name: Car_Model, Length: 1048575, dtype: object

In [18]:
# Karakteristik data Date
print("Range dari Tanggal Pembelian adalah adalah:", df["Date"].min() ,"sampai", df["Date"].max())

Range dari Tanggal Pembelian adalah adalah: 2022-05-01 00:00:00 sampai 2023-05-01 00:00:00

In [19]:
# Karakteristik data Car_Year
print("Range dari Tahun Rilis Mobil adalah adalah:", df["Car_Year"].min() ,"sampai", df["Car_Year"].max())

Range dari Tahun Rilis Mobil adalah adalah: 2010 sampai 2022

In [3]:
# Karakteristik data Sale_Price
print("Range dari harga penjualan mobil adalah adalah:", df["Sale_Price"].min() ,"sampai", df["Sale_Price"].max())

Range dari harga penjualan mobil adalah adalah: 10000 sampai 50000

In [4]:
# Karakteristik data Commission_Rate
print("Range dari tingkat komisi yang dibayarkan kepada penjual adalah adalah:", df["Commission_Rate"].min() ,"sampai", df["Commission_Rate"].max())

Range dari tingkat komisi yang dibayarkan kepada penjual adalah adalah: 0.0500001359597471 sampai 0.1499999836035022

In [5]:
# Karakteristik data Commission_Earned
print("Range dari tingkat komisi yang dibayarkan kepada penjual adalah adalah:", df["Commission_Earned"].min() ,"sampai", df["Commission_Earned"].max())

Range dari tingkat komisi yang dibayarkan kepada penjual adalah adalah: 501.34 sampai 7494.53

In [3]:
# Jumlah data yang kosong
df.isnull().sum()

Date                 0
Salesperson          0
Customer_Name        0
Car_Make             0
Car_Model            0
Car_Year             0
Sale_Price           0
Commission_Rate      0
Commission_Earned    0
dtype: int64